# IsValidValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDistance..::..IsValidValue Method
AssetPropertyDistance Class See Also
---
Checks that the value is a valid value for this property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public bool IsValidValue(
	double value
)
```

Visual Basic
---
```text
Public Function IsValidValue ( _
	value As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidValue(
	double value
)
```

# ### Parameters
value
    Type: System..::..Double The value to be checked.
# ### Return Value
True if the value is valid for the property.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Cannot check validity for a property not being edited in AppearanceAssetEditScope. |

# See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace